// const dataC1 = {
//     "code": 200,
//     "message": "成功",
//     "data": [
//         {
//             "id": 1,
//             "createTime": "2021-12-10 01:31:41",
//             "updateTime": "2022-05-07 11:42:44",
//             "name": "图书/音像/电子书刊"
//         },
//         {
//             "id": 2,
//             "createTime": "2021-12-10 01:31:41",
//             "updateTime": "2021-12-10 01:31:41",
//             "name": "手机"
//         },
//         {
//             "id": 3,
//             "createTime": "2021-12-10 01:31:41",
//             "updateTime": "2021-12-10 01:31:41",
//             "name": "家用电器"
//         },
//         {
//             "id": 4,
//             "createTime": "2021-12-10 01:31:41",
//             "updateTime": "2021-12-10 01:31:41",
//             "name": "数码"
//         },
//         {
//             "id": 5,
//             "createTime": "2021-12-10 01:31:41",
//             "updateTime": "2021-12-10 01:31:41",
//             "name": "家居家装"
//         },
//         {
//             "id": 6,
//             "createTime": "2021-12-10 01:31:41",
//             "updateTime": "2021-12-10 01:31:41",
//             "name": "电脑办公"
//         },
//         {
//             "id": 7,
//             "createTime": "2021-12-10 01:31:41",
//             "updateTime": "2021-12-10 01:31:41",
//             "name": "厨具"
//         },
//         {
//             "id": 8,
//             "createTime": "2021-12-10 01:31:41",
//             "updateTime": "2021-12-10 01:31:41",
//             "name": "个护化妆"
//         },
//         {
//             "id": 9,
//             "createTime": "2021-12-10 01:31:41",
//             "updateTime": "2021-12-10 01:31:41",
//             "name": "服饰内衣"
//         },
//         {
//             "id": 10,
//             "createTime": "2021-12-10 01:31:41",
//             "updateTime": "2021-12-10 01:31:41",
//             "name": "钟表"
//         },
//         {
//             "id": 11,
//             "createTime": "2021-12-10 01:31:41",
//             "updateTime": "2021-12-10 01:31:41",
//             "name": "鞋靴"
//         },
//         {
//             "id": 12,
//             "createTime": "2021-12-10 01:31:41",
//             "updateTime": "2021-12-10 01:31:41",
//             "name": "母婴"
//         },
//         {
//             "id": 13,
//             "createTime": "2021-12-10 01:31:41",
//             "updateTime": "2021-12-10 01:31:41",
//             "name": "礼品箱包"
//         },
//         {
//             "id": 14,
//             "createTime": "2021-12-10 01:31:41",
//             "updateTime": "2022-05-07 11:42:49",
//             "name": "食品饮料/保健食品"
//         },
//         {
//             "id": 15,
//             "createTime": "2021-12-10 01:31:41",
//             "updateTime": "2021-12-10 01:31:41",
//             "name": "珠宝"
//         },
//         {
//             "id": 16,
//             "createTime": "2021-12-10 01:31:41",
//             "updateTime": "2021-12-10 01:31:41",
//             "name": "汽车用品"
//         },
//         {
//             "id": 17,
//             "createTime": "2021-12-10 01:31:41",
//             "updateTime": "2021-12-10 01:31:41",
//             "name": "运动健康"
//         }
//     ],
//     "ok": true
// }

// export default [
//     // 获取品牌信息
//     {
//         url: '/admin/product/getCategory1',
//         method: 'get',
//         response: (request) => {
//             const result = this.dataC1
//             //没有返回失败的信息
//             if (!result) {
//                 return { code: 201, data: { message: '获取属性信息失败' } }
//             }
//             //如果有返回成功信息

//             return result

//         },
//     },
// ]